Revit 2026 API

# SiteSubRegionIsValidBoundary Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidBoundary(
	IList<CurveLoop> curveLoops
)
```
```vb
Public Shared Function IsValidBoundary (
	curveLoops As IList(Of CurveLoop)
) As Boolean
```
```cpp
public:
static bool IsValidBoundary(
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
static member IsValidBoundary :
        curveLoops : IList<CurveLoop> -> bool
```

#### Parameters

curveLoops IListCurveLoop

#### Return Value

Boolean

#### Reference

SiteSubRegion Class

Autodesk.Revit.DB.Architecture Namespace